#include<stdio.h>
//5位运动员参加了10米台跳水比赛，有人让他们预测比赛结果
//A选手说：B第二，我第三；
//B选手说：我第二，E第四；
//C选手说：我第一，D第二；
//D选手说：C最后，我第三；
//E选手说：我第四，A第一；
//比赛结束后，每位选手都说对了一半，请编程确定比赛的名次
//int main()
//{
//	int a, b, c, d, e;
//	for (a = 1; a <= 5; a++)
//	{
//		for (b = 1; b <= 5; b++)
//		{
//			for (c = 1; c <= 5; c++)
//			{
//				for (d = 1; d <= 5; d++)
//				{
//					for (e = 1; e <= 5; e++)
//					{
//						if (((b == 2) + (a == 3) == 1) &&
//							((b == 2) + (e == 4) == 1) &&
//							((c == 1) + (d == 2) == 1) &&
//							((c == 5) + (d == 3) == 1) &&
//							((e == 4) + (a == 1) == 1))
//						{
//							if ((a * b * c * d * e == 120) &&( a + b + c + d + e == 15))
//								printf("A第%d   B第%d   C第%d   D第%d   E第%d  ", a, b, c, d, e);
//						}
//					}
//				}
//			}
//		}
//	}
//	return 0;
//}
//日本某地发生了一件谋杀案，警察通过排查确定杀人凶手必为4个
//嫌疑犯的一个。以下为4个嫌疑犯的供词。
//A说：不是我。
//B说：是C。
//C说：是D。
//D说：C在胡说
//已知3个人说了真话，1个人说的是假话。
//现在请根据这些信息，写一个程序来确定到底谁是凶手
//int main()
//{
//	int a, b, c, d;
//	for (a = 0; a < 2; a++)
//	{
//		for (b = 0; b < 2; b++)
//		{
//			for (c = 0; c < 2; c++)
//			{
//				for (d = 0; d < 2; d++)
//				{
//					if (((a == 0) + (c == 1) + (d == 1) + (d == 0)) == 3)//0代表不是凶手；1代表是凶手
//						if (a + b + c + d == 1)
//						{
//							if (a == 1)
//								printf("凶手是A！");
//							if (b == 1)
//								printf("凶手是B！");
//							if (c == 1)
//								printf("凶手是C！");
//							if (d == 1)
//								printf("凶手是D！");
//						}
//				}
//			}
//		}
//	}
//	return 0;
//}
//在屏幕上打印杨辉三角
//1
//1 1
//1 2 1
//1 3 3 1 
//1 4 6 4 1
//1 5 10 10 5 1
int main()
{
	int n,i,j,t,k;
	long int Bug[21] = { 0,1 };
	printf("请输入杨辉三角形的行数（1 ~ 20）：");
	scanf("%d", &n);
	for (i = 1; i <= n; i++)
	{
		t = 0;
		for (j = 1; j <= i; j++)
		{
			k = Bug[j];
			Bug[j] = k + t;
			t = k;
			printf("%-5d", Bug[j]);
		}
		printf("\n");
	}
	return 0;
}